import streamlit as st
from time import sleep
from PIL import Image
import pandas as pd 

st.header(f"Приветствуем на сайте Digital life school! Digital life school сайтына қош келдіңіздер!")
st.write("Бұл сайтта барлық курс бойынша қысқа ақпарат көрсетілген.")
st.write("На этом сайте предоставлена краткая информация по всем курсам.")
st.image("katana.jpg")

def show_services():
    price1 = 12000
    price2 = 20000
    price3 = 28000
    col1,col2,col3 = st.columns(3)
    with col1:
        st.header("⚔️ Ронин")
        st.write("Самостоятельный путь. Ты учишься в одиночку, следуя гайдам и трекеру.\n"
                 "Ты сам себе учитель — мы даём только меч и карту.\n"
                 "Тәуелсіз жол. Сен трекер мен нұсқаулықтар арқылы жалғыз үйренесің.\n"
                 "Сен өзіңе мұғалімсің — біз тек қылыш пен карта береміз.")
        st.write("Цена / Бағасы:", price1)

    with col2:
        st.header("🧠 Ментор")
        st.write("Путь с поддержкой: гайды, задачи, трекер, чат и созвоны с ментором.\n"
                 "Мы вместе проходим каждый этап обучения.\n"
                 "Қолдау жолы: тапсырмалар, трекер, ментормен чат және қоңыраулар.\n"
                 "Әр кезеңді бірге өтіп, бағытты бірге табамыз.")
        st.write("Цена / Бағасы:", price2)

    with col3:
        st.header("🔥 Ментор+")
        st.write("Продвинутый формат. Личное сопровождение, проверка кода, адаптация под цели.\n"
                 "Идеально для старта в работе, проекте или собеседовании.\n"
                 "Жетілдірілген бағдарлама. Кодты тексеру, жеке көмек, нақты мақсатқа бейімдеу.\n"
                 "Жұмысқа, жобаға немесе сұхбатқа дайындық үшін мінсіз.")
        st.write("Цена / Бағасы:", price3)


show_services()

st.header("🌊 Ты знаешь, какой путь выбрать/Қай жолды таңдау керек екенін өзің шешесің")
st.write("Школа открыта. Меч — у входа. Мектеп ашық. Қылыш босағада")
col1,col2,col3 = st.columns(3)
with col2:
    st.link_button("Записаться/Жазылу","https://wa.me/message/EJ6TMZ7FAL66B1")

